{"temperamentTest":{"phlegmatic":[{"question":"Do you consider yourself a calm and cold-blooded person?"},{"question":"Do you consider yourself consistent and thorough in business?"},{"question":"Are you a cautious and reasonable person?"},{"question":"Can you wait?"},{"question":"Are you silent and don't like talking in vain?"},{"question":"Do you have a calm, uniform speech, with stops, without pronounced emotions, gestures and facial expressions?"},{"question":"Do you consider yourself a reserved and patient person?"},{"question":"Do you finish the business you have started?"},{"question":"You are not wasting your energy, right?"},{"question":"Usually you strictly adhere to a strict routine in life, a system in work?"},{"question":"Do you easily restrain your impulses?"},{"question":"Are you unresponsive to approval and denial?"},{"question":"Are you gentle, show condescension to the taunts addressed to you?"},{"question":"Are you constant in your interests and relationships?"},{"question":"Are you slowly getting into work and switching from one thing to another?"},{"question":"Are you stable with everyone?"},{"question":"Do you like order and order in everything?"},{"question":"Do you usually have difficulty adjusting to a new environment?"},{"question":"Do you have the shutter speed?"},{"question":"Do you usually slowly and gradually meet new people?"}],"melancholic":[{"question":"Are you shy and shy?"},{"question":"Usually lost in a new environment?"},{"question":"Difficult to make contact with new people?"},{"question":"You do not believe in your strength?"},{"question":"Easily endure loneliness?"},{"question":"Do you feel depressed and confused at failure?"},{"question":"Do you tend to go into yourself?"},{"question":"Usually get tired quickly?"},{"question":"Do you have a quiet speech, sometimes whispering?"},{"question":"Involuntarily adapting to the nature of the interlocutor?"},{"question":"Are you a susceptible to tearful person?"},{"question":"Do you consider yourself extremely susceptible to approval and censure by a person?"},{"question":"Do you usually make high demands on yourself and others?"},{"question":"Are you prone to suspicion, suspiciousness?"},{"question":"Are you painfully sensitive and easily vulnerable?"},{"question":"Extremely touchy?"},{"question":"Secretive and uncommunicative, do not share your thoughts with anyone?"},{"question":"Are you inactive and timid?"},{"question":"Resignedly resigned?"},{"question":"Seek compassion and help from others?"}],"choleric":[{"question":"Are you restless, fussy?"},{"question":"Do you consider yourself an intemperate, hot-tempered person?"},{"question":"Are you usually impatient?"},{"question":"Harsh and straightforward in dealing with people?"},{"question":"Are you decisive and initiative?"},{"question":"Consider yourself stubborn?"},{"question":"Are you resourceful in a dispute?"},{"question":"Do you work jerkily?"},{"question":"Are you risk averse?"},{"question":"Are you unremarkable and unobtrusive?"},{"question":"Do you have a fast, passionate, confused speech?"},{"question":"Are you an unbalanced and passionate person?"},{"question":"Are you intolerant of flaws?"},{"question":"Can you characterize yourself as an aggressive bully?"},{"question":"Do you have expressive facial expressions?"},{"question":"Able to act quickly and solve?"},{"question":"Do you usually tirelessly strive for a new one?"},{"question":"Do you have sharp, jerky movements?"},{"question":"Are you persistent in achieving your goal?"},{"question":"Prone to sudden mood swings?"}],"sanguine":[{"question":"Are you a cheerful and cheerful person?"},{"question":"Do you consider yourself energetic and businesslike?"},{"question":"Do you often not finish the job you have started?"},{"question":"Do you usually tend to overestimate yourself?"},{"question":"Able to quickly grasp the new?"},{"question":"Do you consider yourself unstable in interests and inclinations?"},{"question":"Are you easily experiencing setbacks and troubles?"},{"question":"Easily adapt to various circumstances?"},{"question":"Are you usually enthusiastic about any new business?"},{"question":"Do you cool quickly if the business ceases to interest you?"},{"question":"Do you often quickly get involved in a new job and quickly switch from one job to another?"},{"question":"Are you burdened by monotony, everyday, painstaking work?"},{"question":"Are you a sociable and responsive person and do not feel constrained by new people?"},{"question":"Are you hardy and hardworking?"},{"question":"Do you have a fast, loud, distinct speech, accompanied by live gestures, expressive facial expressions?"},{"question":"Do you maintain composure in an unexpected, difficult environment?"},{"question":"Always have a cheerful mood?"},{"question":"Do you fall asleep quickly and wake up?"},{"question":"Are you often not assembled, show haste in decisions?"},{"question":"Sometimes inclined to glide on the surface, distracted?"}],"results":{"phlegmatic":"New forms of behavior are developed slowly, but are persistent. This type has slowness and calm in actions, facial expressions and speech, evenness, constancy, depth of feelings and moods. Phlegmatic people are usually very persistent and persistent, rarely lose their temper, are not prone to affects, having calculated their strength, bring things to an end, are even in relationships, are sociable enough, do not like to talk in vain. Save energy, do not waste them. Depending on the conditions, in some cases the phlegmatic person can be characterized by positive features - endurance, depth of thoughts, constancy, solidity, in others - laziness and a tendency to perform only the usual actions.","melancholic":"Melancholy possesses high sensitivity: there is a depth of feelings with a weak expression. They are characterized by restraint and muffled speech and movements, modesty, caution. Under normal conditions, a melancholic person is a deep, informative, responsible person, successfully coping with life tasks. Under adverse conditions, it can turn into a closed, anxious, vulnerable person, prone to difficult inner experiences of such life circumstances that do not deserve it.","choleric":"Cholerices are characterized by increased excitability, intermittent actions. They are characterized by sharpness and swiftness of movements, strength, impulsiveness, and vivid expressiveness of emotional experiences. Owing to imbalance, being carried away by business, they tend to act with all their might, to be exhausted more than they should. Having public interests, temperament is shown in initiative, energy, integrity. In the absence of spiritual life, choleric temperament often manifests itself in irritability, short temper under emotional circumstances.","sanguine":"Sanguine people quickly adapt to new conditions, quickly converge with people, are sociable. Feelings easily arise and are replaced, their emotional experiences, as a rule, are shallow. Facial expressions are rich, mobile, expressive. People of this type are somewhat restless, need new impressions, insufficiently regulate their impulses, do not know how to strictly adhere to the developed routine of life, the system in work. In this regard, they cannot successfully carry out a task requiring equal expenditure of energy, prolonged and methodical stress, perseverance, stability of attention, patience. In the absence of serious goals, deep thoughts, creative activity, their superficiality and inconstancy often prevail."}},"characterTypeTest":{"introvert":[{"question":"Can a very insignificant event affect an important decision for you?"},{"question":"Can you be very impressed with a good performance, a film for a very long time?"},{"question":"You do not have many friends, do you have difficulty meeting strangers?"},{"question":"Do you remember any situation as a whole better than the details?"},{"question":"You do not like the sound of tape recorders, loud laughter and empty talk?"},{"question":"Do you prefer to have not many things, but comfortable?"},{"question":"Do you like to be photographed?"},{"question":"Do you like souvenirs, gold or some other jewelry?"},{"question":"Do you like to cook?"},{"question":"Are you more comfortable in a large company where you can go unnoticed (to retire) than in a small company where everything is in sight?"},{"question":"Do you find it difficult to adapt to a new environment, situation, team?"},{"question":"Do you persist in upholding your principles?"},{"question":"Are you very suspicious about your health? Do you always think that it is not at your highest level, and does it depress you?"},{"question":"Do you weigh the pros and cons for a long time before making any decision?"},{"question":"Sometimes you are told that you do not see the world as it is. But you do not believe that this is so?"}],"extrovert":[{"question":"In one day, you can watch two films, a performance, read in transport, make an appointment, having only one or two of them?"},{"question":"A disconnected phone makes you discouraged and makes you feel infinitely lonely?"},{"question":"Are your close friends expanding every day?"},{"question":"Do you easily remember faces, cases, biographies, more difficult - formulas and other people's thoughts?"},{"question":"Do you like a fun company, do not tolerate loneliness? Are you an optimist, trying to avoid gloomy, reserved people?"},{"question":"Do you have a accommodating, flexible disposition?"},{"question":"Do you like giving speeches, making toasts?"},{"question":"When gathering at the same table, do you usually sit down in a place from which you could easily watch everyone?"},{"question":"Do you always know where and what is happening?"},{"question":"Do you quickly find contact with strangers, are you well versed in a new company or setting?"},{"question":"Do you make decisions quickly, sometimes assuming that they are not entirely successful?"},{"question":"In a difficult situation, are you able to think things through properly?"},{"question":"You have a lot of plans, problems and ideas, but you understand that you are able to implement only part of them?"},{"question":"You do not really like people who are constantly worried about your health?"},{"question":"What matters to you is what impression you have on others?"}],"results":{"introvert":"Introverts are modest, shy, prone to solitude, prefer books to communication with people. They are restrained, close only to a few, therefore they have few friends, but are devoted to them. People of this type do not like strong impressions, control their emotions, are somewhat pessimistic, non-aggressive, strive for a calm, orderly life. Introverts cannot act contrary to their beliefs, and if they are nevertheless forced to do this or accidentally violate internal norms, they feel bad and are very worried. They do not often refer to strict ethical principles, but they themselves rarely violate the generally established rules of public life. Introverts slowly make connections and find it difficult to enter an alien world of other people's emotions. They have difficulty mastering adequate behavioral forms and therefore often seem awkward. Their subjective point of view may be stronger than the objective situation.","extrovert":"Extroverts are open, courteous, friendly, sociable, have many friends, are prone to verbal communication. They are sociable, talkative, ambitious, assertive and active. Even if extroverts argue, they allow themselves to be influenced. People of this type strive for strong, vivid impressions, are prone to risk, act under the influence of the moment. They love change, are resourceful in conversation, carefree, optimistic. They prefer to act, rather than reason, are prone to aggressive behavior, are unrestrained. Extroverts submit to external requirements not without struggle, but external conditions always prevail. The consciousness of such people is turned outward, because the main and decisive definition is always scooped from there. He is interested in faces and things. Accordingly, the actions of such a person are caused and explained by the influence of the latter. Extroverts tend to do what the environment currently needs and what it expects from it. They are suggestible, accessible to the influence of others, and often sacrifice themselves for the sake of others. According to Jung’s characterization, they tend to constantly squander themselves and get involved in everything, and introverts are protected from external influences, if possible, refrain from all kinds of energy expenditures that directly relate to the object in order to occupy the most reinforced and strong position as possible."}},"characterTest":{"questions":[{"question":"Can you tell a lie?"},{"question":"Do you put up with your shortcomings?"},{"question":"Is it easy to change your mind?"},{"question":"Do you like to talk about yourself?"},{"question":"Do you feel free in an unfamiliar company?"},{"question":"Do you trust people?"},{"question":"Do you like to be praised?"},{"question":"Are you satisfied with yourself?"},{"question":"Do you often talk about other people's shortcomings?"},{"question":"Do you finish the work you have begun?"},{"question":"Are you persistent in achieving the goal?"},{"question":"Do you take initiative in work?"}],"results":{"r1111":"The main character traits: you are energetic and sociable, but proud and inconsistent.","r1000":"The main character traits: you are quite unprincipled, secretive, inactive, selfish.","r1001":"The main character traits: you are lazy, closed, weakly characterized, self-satisfied.","r1011":"The main character traits: you are uncommunicative, ambitious, have strong beliefs, are active.","r0111":"The main character traits: you are principled, businesslike, easily converge with people, but arrogant.","r0110":"The main character traits: you are truthful, persistent, caring.","r0100":"The main character traits: you are educated, unsophisticated, consistent, but passive.","r0000":"The main character traits: you are slow, unsociable, do not know how to set clear goals and achieve them.","r1010":"The main character traits: you are active, but too modest, closed and soft-bodied, which interferes with your career.","r1110":"The main character traits: you are unsophisticated, hardworking, but easily inferior to others the primacy in the competition.","r1100":"The main character traits: you are straightforward, modest, sincere in achieving the goal, but often change your beliefs.","r0001":"The main character traits: you are truthful, but too secretive, self-confident, but inert.","r0011":"The main character traits: you are arrogant and insincere, indefatigable and capable of turning mountains to achieve the goal.","r0101":"The main character traits: you are sociable, open and purposeful, but you lack gambling and business acumen.","r1101":"The main character traits: you are weak-minded, simple-minded, moreover, lazy and selfish are a classic set of a loser.","r0010":"The main character traits: you are persistent, hardworking, but too sociable."}},"favoriteColorTest":{"question":"Often, both men and women prefer one color or at least no more than two or three shades and use these colors when choosing clothes, furniture, even a car, etc. Throughout life, people often change their attitude towards one color or another. But be that as it may, the color you prefer can tell a lot about your character and temperament or mood. Choose the color that most impresses you during this period of your life and it will tell you about the prevailing character traits today.","results":{"white":"This is the perfect color, the color of dreams. It simultaneously conveys the brilliance of light and the cold of ice, so it has a multi-valued meaning. It can be chosen by a person with any character, since this color does not repel anyone.","black":"Black is opposed to white. It symbolizes a gloomy perception of life, insecurity. A person who prefers to dress in black is prone to depression, feels unhappy. If he often changes clothes of black color to another, brighter, catchy, this suggests that he is not overwhelmed by pessimistic moods for a short time.","gray":"Gray is preferred by sensible and incredulous people who are in no hurry to make decisions. Often he is preferred by natures, afraid to declare themselves loudly. People who do not recognize this color are distinguished by an impulsive, frivolous character.","red":"Red is loved by strong-willed, imperious, quick-tempered, sociable natures. Altruists often prefer him. This color annoys notorious people who are prone to solitude, afraid to stand out from the crowd.","orange":"Orange is loved by passionate dreamers and people with tremendous intuition. This color also means hypocrisy and pretense.","brown":"Brown and its shades are preferred by confident people who are firmly on their feet. They value tradition, family. This color is unpleasant for proud, selfish, secretive people who can hardly be called forth for frankness.","yellow":"Yellow symbolizes calmness, ease in relations with people, intelligence. He is preferred by sociable, curious, courageous, sociable people who enjoy the opportunity to like. This color is unpleasant for pessimists, closed natures, with whom it is difficult to make acquaintance.","pink":"Pink is preferred by loving, easily injured, sentimental natures. He kind of calls for love and kindness. Those who like him are able to get excited for a very minor matter. For pragmatic people, this color is annoying.","blue":"Blue is associated with the spiritual exaltation of man, his purity. Humble and melancholy people like him; they need the supportive attitude of others. Uncertain, closed natures do not recognize this color, though they are trying to give the impression that they can do anything. This color is indifferent to frivolous individuals who hide this trait of their character under the guise of courtesy.","green":"Green symbolizes nature, spring, life itself. It is preferred by people who do not succumb to the influence of others, constantly self-affirming. This color is denied by people who are afraid of everyday problems, vicissitudes of fate, generally any difficulties."}},"geometricTest":{"question":"The figure shows five figures (a square, a triangle, a rectangle, a circle, a zigzag) - shapes that allow you to compose your psychological portrait. Look at them carefully, feel your form, about which you can say: “It's me!” and select her. It is from it that you can determine your main character traits and behavioral features.","results":{"square":"If you have chosen a square as your main form, then you are a tireless worker! You are diligent, feel the need to complete the work you have begun to the end, and you always bring it, are persistent. Such qualities as endurance, patience and methodology make the Square a highly qualified specialist in any field of activity. Such a person knows how to collect, organize, instantly issue and apply information. He is considered a scholar, at least in his field. The strength of the Square is thought analysis. Rather, he “calculates” the result than guesses about it. The smallest details of any project will not escape his attention. He is able to work out any ideas that are often offered by representatives of other geometric shapes. The square lives in the usual manner; it does not like “surprises” and changes in the usual course of events. Therefore, he constantly “orders”, organizes people and things around him. These features allow the Square to become an excellent administrator, executor, but, unfortunately, not a businessman, manager. It would seem that he has all the data to become an entrepreneur, but it is precisely these that do not allow him to achieve heights in this occupation. The addiction to details, the constant need for additional information to make a decision does not allow Square to act promptly. And the passion for accuracy, order and accepted rules simply paralyze his determination. Emotional dryness and coldness prevent the Square from finding a common language with people. But if he works in a stable organization, in which clear requirements are formulated and clear instructions for action are given, the Square will take its place under the sun and much more successfully than representatives of other figures.","triangle":"This figure symbolizes leadership. Therefore, the Triangle is a strong personality. He is decisive, energetic, unstoppable, sets clear goals and, as a rule, achieves. This sets him apart from Square. He knows how to analyze the situation in detail, is well versed in detail, but, unlike Square, he knows how to concentrate on the main thing, to determine the essence of the problem. The triangle is a very confident person, trying to constantly prove his case in everything, with great difficulty acknowledges his mistakes, does not like to change decisions, is categorical, does not recognize objections, and in most cases acts in his own way. Intolerant of those who hesitate in making decisions, not afraid to take risks. It is programmed to win, win, success. The triangle is ambitious. He seeks to achieve a high position, to obtain a high status, in other words, to make a career. He is not interested in quality, it is important to stay on the laurels of glory, and how he won this fame does not matter to him. Triangle can become a great manager, entrepreneur. For a hundred kilometers, he senses a bargain and in the fight for it can push his competitors against the foreheads. And why not, because he knows how to perfectly intrigue. In general, scrupulousness is not its quality. On the way to the goal, he does not observe moral standards and can go to it, ignoring others. But all this does not apply to all Triangles. For the most part, these are very nice, attractive people who make everyone and everyone revolve around themselves and without which the lives of other people would lose their sharpness.","rectangle":"It symbolizes the state of transition and change. This is, as it were, a temporary form of personality that the other four figures may have at some periods of their lives. The rectangle is often in a state of confusion, confusion, uncertainty about itself. He is unhappy with the way of life that he leads now, and therefore he is busy looking for a better position. The rectangle is inconsistent and unpredictable in actions, while it is in search of a different status. His mood varies greatly from day to day, and even within one day. He is distinguished by low self-esteem, strives to become better in something, seeks new methods of work, tries to change his lifestyle. This behavior is alarming to others, they do not understand this person, so they try to avoid contact with him. But the Rectangle itself simply needs communication with other people. In spite of everything, the Rectangle has positive character traits that can attract other people: courage, curiosity, perseverance, interest in everything that happens. True, dishonest people often use this. The rectangle should remember that its negative aspects and failures in life are temporary. Everything bad will go away, and he will reach a new level of personal development, enriched by the experience acquired at this stage.","circle":"This figure is a mythological symbol of harmony. Circle Man is sincerely interested in good interpersonal relationships. For him, the most important thing is the well-being of people. The circle is the most benevolent of all forms. It is he who holds the team, family, relatives together. True, he is indecisive, inconsistent, and too soft. Although the last statement lives in it for the time being: The Circle is capable of showing enviable firmness when it comes to matters of morality or violation of justice. The circle is very sensitive, capable of empathy. He feels both someone else's joy and someone else's pain. He is respected by others, drawn to him. The circle is distinguished by amazing intuition, perfectly sees, feels people. He can instantly recognize a dishonorable person, a pretender, a deceiver. But a leader will never come out of him, and business is not the path of the Circle. The circle hates conflicts. He is ready to be the first to yield in everything, just to prevent a quarrel. Reconciliation is the main line of his behavior. This feature of nature has both positive and negative sides: of course, such a character trait pleases others and makes the Circle popular among relatives and colleagues, but too frequent concessions can lead to the loss of self-respect by the Circle. The circle is at odds with logic. He focuses on subjective factors and seeks to find common ground even in opposing points of view. According to psychologists, this is a behavior that unites all views, and everyone likes it. So we can say that the Circle is a born psychologist.","zigzag":"This form - a symbol of creativity - is the only open figure out of five. If you firmly chose a zigzag as the main form, then you are characterized by imagery, intuition, mosaic. Strictness and consistency is not your style. That is why it is difficult for representatives of other forms to understand you. Zigzag does not concentrate on details, and this allows him to build holistic, harmonious images, to see beauty. He is a creative person. He will succeed in various fields of art. The zigzag does not make concessions in conflict situations, on the contrary, it sharpens them and in this acuteness finds a way out of this situation. He likes to “open the eyes of others” to the possibility of a new solution. Representatives of this form perceive the world as constantly changing. There is nothing more boring for them than templates, rules and instructions, as well as people who always agree or pretend to agree. They cannot work for many years in one place, they are annoyed by the regime that is established in organizations, fixed responsibilities and monotonous work. They strive to be independent of others in their work. Only then can they gush with ideas. When they have a new interesting thought, they are ready to share it with the whole world. But their incontinence and expressiveness (“cut the truth in the eyes”), along with eccentricity, often prevent them from realizing their ideas. Often their enthusiasm breaks down on closed doors, they cool down and do not realize their plans. Other people find Zigzags sexually attractive."}},"difficultyTest":{"explanation":"This test developed by A. Libina will help you determine how characteristic the proposed options for behavior in a difficult situation are for you. For an answer, you can use one of the suggested answer options based on your usual behavior in a difficult (problem, unpleasant, conflict) situation.","questions":[{"question":"I always and in everything follow the same line of behavior. I have my own principles, and I'm not going to change them!"},{"question":"I find myself wholly in the grip of negative experiences."},{"question":"I am patient and wait for the situation to resolve itself."},{"question":"I try not to think about troubles. Anyway, nothing depends on me."},{"question":"I lose the sense of reality of what is happening, the unfolding events seem to me a bad dream."},{"question":"I am absolutely lost, confused in my feelings, exaggerating the problem or, conversely, belittling its value. It is difficult for me to objectively assess whether this situation is catastrophic or not."},{"question":"I try at all costs to maintain a sense of familiar comfort, even at the cost of abandoning the desired goal."},{"question":"I notice that my speculation distorts the reality of things."},{"question":"I take the first decision that comes to mind and calm down on this."},{"question":"I try not to do anything to make it worse."},{"question":"I want to close my eyes and not think about anything."},{"question":"I resort to a saving bad habit (I smoke, drink coffee or alcohol, eat cakes and sweets, “hang up” on the phone, etc.), although I understand deep down that it won’t save me."},{"question":"I begin to engage in other matters, “important” and “urgent”."},{"question":"I’m looking for someone to complain about - tell me about the troubles that happened to me."},{"question":"I tear off my irritation and anger at all who turn up by the arm."}],"answers":{"never":0,"extremelyRarely":2,"rarely":4,"sometimes":5,"often":7,"almostAlways":9,"always":10},"results":{"result1":"You can be congratulated: you perceive any defeat as a lesson and derive maximum benefit from it for your victorious march through life!","result2":"You, like all normal people, sometimes allow yourself to be bothered instead of solving the problem. The main thing is that the “emotional” period should not be delayed.","result3":"The result of the test revealed an alarming symptom warning that the “protective” behavior is beginning to seriously complicate your life. It is necessary to approach life more with confidence than with caution. Otherwise, the mogug could face problems both in life in general and with psychological health.","result4":"Protective behavior has become your lifestyle, which in no way contributes to success. You should reconsider your views on difficulties and learn how to overcome them, but only in the case where it is needed, because many of the problems are contrived. This should be seriously considered."}},"currentStateTest":{"questions":[{"question1":"Feeling good","question2":"Feeling unwell"},{"question1":"I feel strong","question2":"I feel weak"},{"question1":"Active","question2":"Passive"},{"question1":"Mobile","question2":"Inactive"},{"question1":"Cheerful","question2":"Sad"},{"question1":"Good mood","question2":"Bad mood"},{"question1":"Workable","question2":"Broken"},{"question1":"Full of strength","question2":"Exhausted"},{"question1":"Fast","question2":"Slow"},{"question1":"Active","question2":"Inactive"},{"question1":"Happy","question2":"Unhappy"},{"question1":"Cheerful","question2":"Gloomy"},{"question1":"Relaxed","question2":"Tense"},{"question1":"Healthy","question2":"Sick"},{"question1":"Keen on","question2":"Indifferent"},{"question1":"Indifferent","question2":"Excited"},{"question1":"Enthusiastic","question2":"Dull"},{"question1":"Glad","question2":"Sad"},{"question1":"Rested","question2":"Tired"},{"question1":"Fresh","question2":"Exhausted"},{"question1":"Excited","question2":"Sleepy"},{"question1":"A desire to work","question2":"Desire to rest"},{"question1":"Calm","question2":"Preoccupied"},{"question1":"Optimistic","question2":"Pessimistic"},{"question1":"Hardy","question2":"Tired"},{"question1":"Peppy","question2":"Sluggish"},{"question1":"Easy to figure out","question2":"Hard to figure out"},{"question1":"Attentive","question2":"Scattered"},{"question1":"Full of hope","question2":"Disappointed"},{"question1":"Satisfied","question2":"Displeased"}],"answers":[7,6,5,4,3,2,1],"results":{"result1":"Low grade.","result2":"Average rating.","result3":"High mark."}}}
